# Multiply Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
UV..::..Multiply Method
UV Class See Also
---
Multiplies this 2-D vector by the specified value and returns the result.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public UV Multiply(
	double value
)
```

Visual Basic
---
```text
Public Function Multiply ( _
	value As Double _
) As UV
```

Visual C++
---
```text
public:
UV^ Multiply(
	double value
)
```

# ### Parameters
value
    Type: System..::..DoubleThe value to multiply with this vector.
# ### Return Value
The multiplied 2-D vector.
# Remarks
The multiplied vector is obtained by multiplying each coordinate of this vector by the specified value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the specified value is an infinite number. |

# See Also
UV Class
Autodesk.Revit.DB Namespace